
# Имя - Светлана
# Фамилия - Беляева
# Возраст - 34
# Колличество котов - 2
# Колличество собак - 1

#1. Описать себя, используюя список
a=['Светлана','Беляева',34,2,1]
print(a)

#2. Описать себя, используюя словарь
b={'Имя':'Светлана','Фамилия':'Беляева','Возраст':34,'Колличество котов':2,'Колличество собак':1}
print(b)

#3. Мне кажется, что работа со списком проще с точки зрения обработки информации,
# т.к. при однотипных данных проще получить доступ по числовому индексу, нежели по текстовому ключу
print(a[4])
print(b['Колличество собак'])